#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include<time.h>

//int main(){
//	//int a = 3 / 5;//0.6 - 0
////	float b = 6 / 5;//1.2 - 1.000000
////	float c = 6 / 5.0;//1.200000
////	float d = 6.0 / 5.0;//警告6.0,5.0默认为double精度丢失 
//	
//	int a = 7 % 3;//2 
//	
//} 


//int main(){
//	int a = 2;
//	int b = a << 1;//4
//	int c = a >> 1;//5进行逻辑右移 
//	int d = -1;
//	int e = d >> 1;//-1进行算术右移 
//	int f = d >> -1;//未定义 
//}

//int main(){
//	int a = 3;
//	int b = 5;
//	//& - 按(2进制)位与
//	int c = a & b;//1
//	//
//	//00000000000000000000000000000011 
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001
//	
//	//| - 按(2进制)位或 
//	int c = a | b;//7
//	//
//	//00000000000000000000000000000011 
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	
//	//^ - 按(2进制)位异或 
//	int c = a ^ b;//6
//	//
//	//00000000000000000000000000000011 
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//}

int main(){
	int a = 3;
	int b = 5;
	printf("a = %d b = %d\n",a,b);
	a = a + b;
	b = a - b;
	a = a - b;
	printf("a = %d b = %d\n",a,b);//方法一受int限制
	
 	int a = 3;
	int b = 5;
	printf("a = %d b = %d\n",a,b);
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("a = %d b = %d\n",a,b);//方法二
} 